Terraform will perform the following actions:

  # module.vpc.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-igw"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
        }
      + tags_all = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-igw"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-private-rt"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
        }
      + tags_all         = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-private-rt"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-public-rt"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
        }
      + tags_all         = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-public-rt"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-private-1"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
          + "Type"        = "Private"
        }
      + tags_all                                       = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-private-1"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
          + "Type"        = "Private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-private-2"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
          + "Type"        = "Private"
        }
      + tags_all                                       = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-private-2"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
          + "Type"        = "Private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-public-1"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-public-1"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
          + "Type"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-public-2"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-public-2"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
          + "Type"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-vpc"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
        }
      + tags_all                             = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-vpc"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
